# Dict for RU messages
LEXICON_MESSAGES_RU: dict[str, str] = {
    '/start': 'Привет! Привет!',
    '/help': 'Нет тут пока никакой помощи 🤓\n\n'
             'Я просто делаю вид, что "I`m your father" 💂‍♀️️',
    'say_what': 'Вот тут не понятно 😩\n\n'
                'Я ведь бот 🤖. Я не все команды понимаю.\n'
                'Попробуй напиши по-другому\n'
                'или посмотри список команд /help',
    'yes': 'Давай 😍',
    'no': 'Неееееет 😭',
    'yes_to_no': 'Да я всё равно пошучу 👹'
}

# Dict for sending stickers
LEXICON_STICKERS: dict[str, str] = {
    'say_what_sticker': 'CAACAgIAAxkBAAIPDmUKwWOANpC3iUQpEDVKAST1UwnAAAIurwEAAWOLRgxvZawu4Zn91TAE',
    'lol': 'CAACAgIAAxkBAAIPEWULHOptr42wmLLlpMpxRkiRELtGAAK-DwAC9uTQSZ6MnpWN_CLyMAQ'
}

LEXICON_COMMANDS: dict[str, str] = {
    '/help': 'Справка по работе бота',
    '/joke': 'Прислать великолепную шутку!'
}

LEXICON_JOKES: dict[int, str] = {
    1: 'Митинг косоглазых состоялся на сорок метров левее здания городской администрации.',
    2: '- Что такое красное и вредно для зубов?\n'
       '- Кирпич',
    3: 'Девушка не вовремя сделала каменное лицо и утонула.',
    4: '— Скажите, Сергей, а как вы догадались, что в доме есть кто—то чужой?\n'
       '— Ну, у нас в семье как—то не принято внезапно бить меня сзади табуреткой по голове.',
    5: '— Неужели тебе сложно ответить? Что за игнор?\n'
       '— Молодой человек, отойдите от гроба.',
    6: 'Непринципиальный священник начал проповедь словами «Хотите — верьте, хотите — нет».',
    7: 'Когда перестает работать интернет, ты можешь погрузиться в свои мысли и серьезно поду...\n'
       'А нет, всё, заработал.',
    8: 'Молодой мясник не знал с чего начать и представился свинье.',
    9: 'У самой заботливой в мире девочки хомячок весит 22 килограмма.',
    10: 'Чтобы хоть как—то отвлечь внимание от дырки в носке, мальчик Петя ударил именинницу табуреткой.'
}